cases/4x/15/system/include/surfaces
"Vehicle0.stl" "Vehicle1.stl" "Vehicle2.stl" "Vehicle3.stl"
